export function getTranslations(lang) {
  let titles, practices, disputes, business, familyLaw, supervisor, other

  switch (lang) {
    case 'ru':
      titles = ['Популярні послуги', 'Інше', 'Наші контакти']
      practices = [
        'Вирішення спорів',
        'Захист бізнесу',
        'Адвокат зі сімейних спорів',
        'Адвокат по стягненню заборгованності',
      ]
      disputes = [
        'Адвокат з трудових спорів',
        'Адвокат з банківських і фінансових спорів',
        'Адвокат з судових спорів',
        'Адвокат зі спорів щодо нерухомості',
      ]
      business = ['Захист бізнесу від рейдерства']
      familyLaw = [
        'Адвокат з розлучення',
        'Адвокат з поділу майна',
        'Адвокат з поділу бізнесу',
        'Адвокат з аліментів',
        'Усиновлення дитини',
        'Позбавлення батьківських прав',
      ]
      supervisor = [
        'Написати керівнику',
        'Якщо ви залишилися не задоволені нашою роботою або щось пішло не так. Напишіть керівнику компанії',
        'Написати',
      ]
      other = ['Політика конфіденційності', 'Договір оферти', 'Прайс', 'Про нас', 'Місія, цінності, стандарти']
      break

    case 'en':
      titles = ['Популярні послуги', 'Інше', 'Наші контакти']
      practices = [
        'Вирішення спорів',
        'Захист бізнесу',
        'Адвокат зі сімейних спорів',
        'Адвокат по стягненню заборгованності',
      ]
      disputes = [
        'Адвокат з трудових спорів',
        'Адвокат з банківських і фінансових спорів',
        'Адвокат з судових спорів',
        'Адвокат зі спорів щодо нерухомості',
      ]
      business = ['Захист бізнесу від рейдерства']
      familyLaw = [
        'Адвокат з розлучення',
        'Адвокат з поділу майна',
        'Адвокат з поділу бізнесу',
        'Адвокат з аліментів',
        'Усиновлення дитини',
        'Позбавлення батьківських прав',
      ]
      supervisor = [
        'Написати керівнику',
        'Якщо ви залишилися не задоволені нашою роботою або щось пішло не так. Напишіть керівнику компанії',
        'Написати',
      ]
      other = ['Політика конфіденційності', 'Договір оферти', 'Прайс', 'Про нас', 'Місія, цінності, стандарти']
      break

    default:
      titles = ['Популярні послуги', 'Інше', 'Наші контакти']
      practices = [
        'Вирішення спорів',
        'Захист бізнесу',
        'Адвокат зі сімейних спорів',
        'Адвокат по стягненню заборгованності',
      ]
      disputes = [
        'Адвокат з трудових спорів',
        'Адвокат з банківських і фінансових спорів',
        'Адвокат з судових спорів',
        'Адвокат зі спорів щодо нерухомості',
      ]
      business = ['Захист бізнесу від рейдерства']
      familyLaw = [
        'Адвокат з розлучення',
        'Адвокат з поділу майна',
        'Адвокат з поділу бізнесу',
        'Адвокат з аліментів',
        'Усиновлення дитини',
        'Позбавлення батьківських прав',
      ]
      supervisor = [
        'Написати керівнику',
        'Якщо ви залишилися не задоволені нашою роботою або щось пішло не так. Напишіть керівнику компанії',
        'Написати',
      ]
      other = ['Політика конфіденційності', 'Договір оферти', 'Прайс', 'Про нас', 'Місія, цінності, стандарти']
      break
  }
  return { titles, practices, disputes, business, familyLaw, supervisor, other }
}
